{
  "term": "Spring",
  "year": "2023",
  "level": [
    "Undergraduate"
  ],
  "topics": [
    [
      "Engineering",
      "Aerospace Engineering",
      "Structural Mechanics"
    ]
  ],
  "legacy_uid": "",
  "instructors": {
    "content": [
      "c52a2cd3-e2b0-3da9-77a3-0aa88635c03b"
    ],
    "website": "ocw-www"
  },
  "course_image": {
    "content": "",
    "website": "structural-mechanics"
  },
  "course_title": "Structural Mechanics",
  "hide_download": false,
  "course_description": "This junior and senior-level course provides the fundamental knowledge to understand, analyze and design load-bearing structures. Although the focus is on aerospace applications, the theory and the majority of the applications are equally relevant in other areas of structural analysis. The first part of the course provides an in-depth study of three-dimensional elasticity theory, including the concepts of stress and strain, equilibrium, compatibility, and elastic constitutive laws and anisotropic materials. The second part focuses on classical analytical solution procedures of the boundary value problem of isotropic linear elasticity in situations of important practical application. This includes states of plane strain, plane stress, and torsion. This is followed by analyzing structural elements with increasing complexity: simple beam theory, combined bending, shear, and torsion of thin-wall shell beams, and buckling.\n\nStudents who successfully complete 16.20 will have the ability to:\n\n1. **formulate** and **apply** appropriate mathematical and numerical models to predict the state of stress and deformation of one, two, and three-dimensional aerospace structures.\n2. **explain** the limitations of the models, **assess** their applicability to realistic configurations, and estimate the errors resulting from their application.\n3. **apply** the concepts learned in the course to **evaluate** and **explain** the possibility of failure in aerospace structural components and systems.",
  "department_numbers": [
    "16"
  ],
  "extra_course_numbers": "",
  "primary_course_number": "16.20",
  "course_image_thumbnail": {
    "content": "",
    "website": "structural-mechanics"
  },
  "learning_resource_types": [
    "Lecture Notes"
  ],
  "site_uid": "561a1f55-f848-44f6-9d56-80ce200beabb",
  "site_short_id": "16.20-spring-2023"
}